### Terraform Plan Output
```
data.aws_key_pair.tfc-demo: Reading...
data.aws_ami.ubuntu: Reading...
data.aws_key_pair.tfc-demo: Read complete after 1s [id=key-0aa7d350f26741b1d]
data.aws_ami.ubuntu: Read complete after 1s [id=ami-03aa885dc6576ab5f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_attachment.three-tier-web-asattach will be created
  + resource "aws_autoscaling_attachment" "three-tier-web-asattach" {
      + autoscaling_group_name = "three-tier-web-asg"
      + id                     = (known after apply)
      + lb_target_group_arn    = (known after apply)
    }

  # aws_autoscaling_group.three-tier-web-asg will be created
  + resource "aws_autoscaling_group" "three-tier-web-asg" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 3
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + launch_configuration             = (known after apply)
      + load_balancers                   = (known after apply)
      + max_size                         = 10
      + metrics_granularity              = "1Minute"
      + min_size                         = 2
      + name                             = "three-tier-web-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = (known after apply)
        }
    }

  # aws_eip.three-tier-nat-eip will be created
  + resource "aws_eip" "three-tier-nat-eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = (known after apply)
    }

  # aws_internet_gateway.three-tier-igw will be created
  + resource "aws_internet_gateway" "three-tier-igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "three-tier-nhvr-igw"
        }
      + tags_all = {
          + "Name" = "three-tier-nhvr-igw"
        }
      + vpc_id   = (known after apply)
    }

  # aws_launch_configuration.three-tier-web-lconfig will be created
  + resource "aws_launch_configuration" "three-tier-web-lconfig" {
      + arn                         = (known after apply)
      + associate_public_ip_address = true
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + id                          = (known after apply)
      + image_id                    = "ami-03aa885dc6576ab5f"
      + instance_type               = "t2.micro"
      + key_name                    = "tfc-demo"
      + name                        = (known after apply)
      + name_prefix                 = "three-tier-web-lconfig"
      + security_groups             = (known after apply)
      + user_data                   = "0cb51576929b62895f16a1d4caec7c092bbd0fe8"
    }

  # aws_lb.three-tier-app-lb will be created
  + resource "aws_lb" "three-tier-app-lb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = true
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "three-tier-app-lb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Environment" = "three-tier-app-lb"
        }
      + tags_all                                                     = {
          + "Environment" = "three-tier-app-lb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_lb.three-tier-web-lb will be created
  + resource "aws_lb" "three-tier-web-lb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "three-tier-web-lb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Environment" = "three-tier-web-lb"
        }
      + tags_all                                                     = {
          + "Environment" = "three-tier-web-lb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.three-tier-app-lb-listner will be created
  + resource "aws_lb_listener" "three-tier-app-lb-listner" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_listener.three-tier-web-lb-listner will be created
  + resource "aws_lb_listener" "three-tier-web-lb-listner" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.three-tier-app-lb-tg will be created
  + resource "aws_lb_target_group" "three-tier-app-lb-tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "three-tier-app-lb-tg"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 10
          + unhealthy_threshold = 3
        }
    }

  # aws_lb_target_group.three-tier-web-lb-tg will be created
  + resource "aws_lb_target_group" "three-tier-web-lb-tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "three-tier-web-lb-tg"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 10
          + unhealthy_threshold = 3
        }
    }

  # aws_nat_gateway.three-tier-natgw-01 will be created
  + resource "aws_nat_gateway" "three-tier-natgw-01" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "three-tier-nhvr-natgw-01"
        }
      + tags_all                           = {
          + "Name" = "three-tier-nhvr-natgw-01"
        }
    }

  # aws_route_table.three-tier-app-rt will be created
  + resource "aws_route_table" "three-tier-app-rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "three-tier-nhvr-app-rt"
        }
      + tags_all         = {
          + "Name" = "three-tier-nhvr-app-rt"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.three-tier-web-rt will be created
  + resource "aws_route_table" "three-tier-web-rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "three-tier-nhvr-web-rt"
        }
      + tags_all         = {
          + "Name" = "three-tier-nhvr-web-rt"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.three-tier-rt-as-1 will be created
  + resource "aws_route_table_association" "three-tier-rt-as-1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.three-tier-rt-as-2 will be created
  + resource "aws_route_table_association" "three-tier-rt-as-2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.three-tier-rt-as-3 will be created
  + resource "aws_route_table_association" "three-tier-rt-as-3" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.three-tier-rt-as-4 will be created
  + resource "aws_route_table_association" "three-tier-rt-as-4" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.three-tier-rt-as-5 will be created
  + resource "aws_route_table_association" "three-tier-rt-as-5" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.three-tier-rt-as-6 will be created
  + resource "aws_route_table_association" "three-tier-rt-as-6" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.three-tier-alb-sg-1 will be created
  + resource "aws_security_group" "three-tier-alb-sg-1" {
      + arn                    = (known after apply)
      + description            = "load balancer security group for web tier"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "three-tier-alb-sg-1"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "three-tier-alb-sg-1"
        }
      + tags_all               = {
          + "Name" = "three-tier-alb-sg-1"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.three-tier-alb-sg-2 will be created
  + resource "aws_security_group" "three-tier-alb-sg-2" {
      + arn                    = (known after apply)
      + description            = "load balancer security group for app tier"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "three-tier-alb-sg-2"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "three-tier-alb-sg-2"
        }
      + tags_all               = {
          + "Name" = "three-tier-alb-sg-2"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.three-tier-db-sg will be created
  + resource "aws_security_group" "three-tier-db-sg" {
      + arn                    = (known after apply)
      + description            = "allow traffic from app tier"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.32/28",
                  + "10.0.0.48/28",
                ]
              + description      = "Access for the web ALB SG"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
            },
        ]
      + name                   = "three-tier-db-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.three-tier-ec2-asg-sg will be created
  + resource "aws_security_group" "three-tier-ec2-asg-sg" {
      + arn                    = (known after apply)
      + description            = "Allow traffic from VPC"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "three-tier-ec2-asg-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "three-tier-ec2-asg-sg"
        }
      + tags_all               = {
          + "Name" = "three-tier-ec2-asg-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.three-tier-ec2-asg-sg-app will be created
  + resource "aws_security_group" "three-tier-ec2-asg-sg-app" {
      + arn                    = (known after apply)
      + description            = "Allow traffic from web tier"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "three-tier-ec2-asg-sg-app"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "three-tier-ec2-asg-sg-app"
        }
      + tags_all               = {
          + "Name" = "three-tier-ec2-asg-sg-app"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.three-tier-pub-sub-1 will be created
  + resource "aws_subnet" "three-tier-pub-sub-1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/28"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "three-tier-nhvr-pub-sub-1"
        }
      + tags_all                                       = {
          + "Name" = "three-tier-nhvr-pub-sub-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.three-tier-pub-sub-2 will be created
  + resource "aws_subnet" "three-tier-pub-sub-2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.16/28"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "three-tier-nhvr-pub-sub-2"
        }
      + tags_all                                       = {
          + "Name" = "three-tier-nhvr-pub-sub-2"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.three-tier-pvt-sub-1 will be created
  + resource "aws_subnet" "three-tier-pvt-sub-1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.32/28"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "three-tier-nhvr-pvt-sub-1"
        }
      + tags_all                                       = {
          + "Name" = "three-tier-nhvr-pvt-sub-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.three-tier-pvt-sub-2 will be created
  + resource "aws_subnet" "three-tier-pvt-sub-2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.48/28"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "three-tier-nhvr-pvt-sub-2"
        }
      + tags_all                                       = {
          + "Name" = "three-tier-nhvr-pvt-sub-2"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.three-tier-pvt-sub-3 will be created
  + resource "aws_subnet" "three-tier-pvt-sub-3" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.64/28"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "three-tier-nhvr-pvt-sub-3"
        }
      + tags_all                                       = {
          + "Name" = "three-tier-nhvr-pvt-sub-3"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.three-tier-pvt-sub-4 will be created
  + resource "aws_subnet" "three-tier-pvt-sub-4" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.80/28"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "three-tier-nhvr-pvt-sub-4"
        }
      + tags_all                                       = {
          + "Name" = "three-tier-nhvr-pvt-sub-4"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.three-tier-vpc will be created
  + resource "aws_vpc" "three-tier-vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "three-tier-vpc"
        }
      + tags_all                             = {
          + "Name" = "three-tier-vpc"
        }
    }

Plan: 32 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws-key-pair-id                  = "key-0aa7d350f26741b1d"
  + aws-key-pair-name                = "tfc-demo"
  + aws-lb-app-dns-name              = (known after apply)
  + aws-lb-web-dns-name              = (known after apply)
  + aws-three-tier-alb-sg-1-id       = (known after apply)
  + aws-three-tier-alb-sg-2-id       = (known after apply)
  + aws-three-tier-app-lb-id         = (known after apply)
  + aws-three-tier-app-lb-listner-id = (known after apply)
  + aws-three-tier-app-lb-tg-arn     = (known after apply)
  + aws-three-tier-app-rt-id         = (known after apply)
  + aws-three-tier-db-sg-id          = (known after apply)
  + aws-three-tier-ec2-asg-sg-app-id = (known after apply)
  + aws-three-tier-ec2-asg-sg-id     = (known after apply)
  + aws-three-tier-igw-id            = (known after apply)
  + aws-three-tier-nat-eip-id        = (known after apply)
  + aws-three-tier-natgw-01-id       = (known after apply)
  + aws-three-tier-pub-sub-1-id      = (known after apply)
  + aws-three-tier-pub-sub-2-id      = (known after apply)
  + aws-three-tier-pvt-sub-1-id      = (known after apply)
  + aws-three-tier-pvt-sub-2-id      = (known after apply)
  + aws-three-tier-pvt-sub-3-id      = (known after apply)
  + aws-three-tier-pvt-sub-4-id      = (known after apply)
  + aws-three-tier-vpc-id            = (known after apply)
  + aws-three-tier-web-lb-dns-name   = (known after apply)
  + aws-three-tier-web-lb-id         = (known after apply)
  + aws-three-tier-web-lb-listner-id = (known after apply)
  + aws-three-tier-web-lb-tg-arn     = (known after apply)
  + aws-three-tier-web-rt-id         = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"

```